src/AccumulationRegisters/ЗакупкиПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗакупкиПоЗаказам</Name>
			<Comment>Блок учета закупок товаров</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество принятого товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаказаУпр</Name>
					<Comment>Сумма по заказу в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Недопоставлено</Name>
					<Comment>Количество недопоставленной номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НедопоставленоСуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перепоставлено</Name>
					<Comment>Количество переопоставленной номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерепоставленоСуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышениеСтоимостиУпр</Name>
					<Comment>Сумма в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПонижениеСтоимостиУпр</Name>
					<Comment>Понижение стоимости в валюте упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма в валюте рег. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаказаРег</Name>
					<Comment>Сумма по заказу в валюте рег. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НедопоставленоСуммаРег</Name>
					<Comment>Сумма в валюте рег. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерепоставленоСуммаРег</Name>
					<Comment>Сумма в валюте рег. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышениеСтоимостиРег</Name>
					<Comment>Сумма в валюте рег. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПонижениеСтоимостиРег</Name>
					<Comment>Понижение стоимости в валюте рег. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗакупкиПоЗаказам/Ext/RecordSetModule.bsl
// Модуль набора записей регистра накоплений "Закупки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем Контрагент Экспорт; // контрагент
Перем ДокументОбъект Экспорт;            // документ объект
//Перем РезультатЗапросаПоТоварам Экспорт; // результат запроса по товарам
Перем РежимПроведения Экспорт;		// Режим проведения документа оперативный/неоперативный
Перем Сторно Экспорт; // Булево. Истина - возврат от покупателя
Перем РезультатЗапросаПоПартиям Экспорт; // результат запроса по партиям
Перем ЗаказОснование Экспорт;
Перем ЗакрытиеЗаказовПоставщикам Экспорт;

#КонецОбласти

// фиксируем продажи
Функция Приход() Экспорт
	
	Результат = Истина;
	
	// получаем таблицу партий
	Если РезультатЗапросаПоПартиям = Неопределено Тогда
		ЕстьДвиженияПоПартиям = (НЕ ДокументОбъект.Движения.Найти("ПартииТоваровКомпании") = Неопределено);
		Если ЕстьДвиженияПоПартиям Тогда
			ТаблицаПартий = ДокументОбъект.Движения.ПартииТоваровКомпании.Выгрузить();
		Иначе
			ТекстСообщения = НСтр("ru = 'Документ <%1> не имеет информации о движениях по партиям.'");
			ВывестиСообщение(ТекстСообщения,,,,, ДокументОбъект.Ссылка);
		КонецЕсли;
	Иначе //документ может и не иметь движений по партионному регистру
		ТаблицаПартий = РезультатЗапросаПоПартиям.Скопировать();
	КонецЕсли;
	
	// получаем таблицу заказов поставщику
	Если ДокументОбъект.Движения.Найти("ЗаказыПоставщикам") = Неопределено Тогда
		// убиваем циклическую ссылку
		ДокументОбъект            = Неопределено;
		РезультатЗапросаПоПартиям = Неопределено;
		ТаблицаПартий             = Неопределено;
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаДвиженийПоЗаказам = ДокументОбъект.Движения.ЗаказыПоставщикам.Выгрузить();
	
	Если НЕ Сторно Тогда
		СтруктураОтбора = Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход);
		МассивНайденныхПартий = ТаблицаПартий.НайтиСтроки(СтруктураОтбора);
		Для Каждого ТекСтрока Из МассивНайденныхПартий Цикл
			ТаблицаПартий.Удалить(ТекСтрока);
		КонецЦикла;
		
		СтруктураОтбора = Новый Структура("ВидДвижения", ВидДвиженияНакопления.Приход);
		МассивНайденныхЗаказов = ТаблицаДвиженийПоЗаказам.НайтиСтроки(СтруктураОтбора);
		Для Каждого ТекСтрока Из МассивНайденныхЗаказов Цикл
			ТаблицаДвиженийПоЗаказам.Удалить(ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	// свернем таблицу движений
	ТаблицаПартий.Свернуть("Номенклатура", "СуммаУпр, Количество");
	Коэффициент = ПланированиеСервер.ПолучитьКоэффициентПересчетаВалют(ДокументОбъект.Дата);
		
	ТаблицаДвиженийПоЗаказам.Свернуть("Контрагент, ЗаказПоставщику, Номенклатура", "СуммаУпр, Заказано");
	Счетчик         = 1;
	КоличествоСтрок = ТаблицаДвиженийПоЗаказам.Количество()-1;
	Для Каждого СтрокаЗаказов Из ТаблицаДвиженийПоЗаказам Цикл
		
		Если СтрокаЗаказов.Заказано = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПартии = ТаблицаПартий.Найти(СтрокаЗаказов.Номенклатура, "Номенклатура");
		
		НоваяЗапись = Добавить();
		НоваяЗапись.Период          = ДокументОбъект.Дата;
		НоваяЗапись.Регистратор     = ДокументОбъект.Ссылка;
		НоваяЗапись.Контрагент      = Контрагент;
		НоваяЗапись.ЗаказПоставщику = СтрокаЗаказов.ЗаказПоставщику;
		НоваяЗапись.Номенклатура    = СтрокаЗаказов.Номенклатура;
		НоваяЗапись.ХозОперация     = ДокументОбъект.ХозОперация;
		НоваяЗапись.Заказано        = СтрокаЗаказов.Заказано;
		НоваяЗапись.СуммаЗаказаУпр  = СтрокаЗаказов.СуммаУпр;
		
		Если СтрокаПартии = Неопределено ИЛИ СтрокаПартии.Количество = 0 Тогда
			Если ЗакрытиеЗаказовПоставщикам = 1 Тогда
				НоваяЗапись.Недопоставлено = СтрокаЗаказов.Заказано;
				НоваяЗапись.НедопоставленоСуммаУпр  = СтрокаЗаказов.СуммаУпр;
			КонецЕсли;
		Иначе
			
			КоличествоКРаспределению = Мин(СтрокаПартии.Количество, СтрокаЗаказов.Заказано);
			
			НоваяЗапись.Количество = КоличествоКРаспределению;
			
			Если КоличествоКРаспределению = СтрокаПартии.Количество Тогда
				НоваяЗапись.СуммаУпр = СтрокаПартии.СуммаУпр;
				ТаблицаПартий.Удалить(СтрокаПартии);
			Иначе
				НоваяЗапись.СуммаУпр = Окр(СтрокаПартии.СуммаУпр/СтрокаПартии.Количество*КоличествоКРаспределению, 2);
				СтрокаПартии.Количество  = СтрокаПартии.Количество - НоваяЗапись.Количество;
				СтрокаПартии.СуммаУпр    = СтрокаПартии.СуммаУпр - НоваяЗапись.СуммаУпр;
					
				ЭтоПерепоставка = Истина;
				Для Ном = Счетчик По КоличествоСтрок Цикл
					СтрокаПоиска = ТаблицаДвиженийПоЗаказам[Ном];
					Если СтрокаПоиска.Номенклатура = СтрокаЗаказов.Номенклатура Тогда
						ЭтоПерепоставка = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ЭтоПерепоставка Тогда
					НоваяЗапись.Количество             = НоваяЗапись.Количество + СтрокаПартии.Количество;
					НоваяЗапись.СуммаУпр               = НоваяЗапись.СуммаУпр + СтрокаПартии.СуммаУпр;
					НоваяЗапись.Перепоставлено         = СтрокаПартии.Количество;
					НоваяЗапись.ПерепоставленоСуммаУпр = СтрокаПартии.СуммаУпр;
					ТаблицаПартий.Удалить(СтрокаПартии);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗакрытиеЗаказовПоставщикам = 1 И НоваяЗапись.Заказано > НоваяЗапись.Количество Тогда
				НоваяЗапись.Недопоставлено = СтрокаЗаказов.Заказано-КоличествоКРаспределению;
				НоваяЗапись.НедопоставленоСуммаУпр  = СтрокаЗаказов.СуммаУпр-НоваяЗапись.СуммаУпр;//СтрокаПартии.СуммаУпр;
			КонецЕсли;
			
			РазницаСумм = Окр(СтрокаЗаказов.СуммаУпр/СтрокаЗаказов.Заказано*НоваяЗапись.Количество, 2) - НоваяЗапись.СуммаУпр;
			Если РазницаСумм>0 Тогда
				НоваяЗапись.ПонижениеСтоимостиУпр = РазницаСумм;
			Иначе
				НоваяЗапись.ПовышениеСтоимостиУпр = -РазницаСумм;
			КонецЕсли;
			
		КонецЕсли;
		
		// если возвраты, то сделаем все отрицательным
		Если Сторно Тогда
			НоваяЗапись.Количество  = НоваяЗапись.Количество*?(НоваяЗапись.Количество>0,-1,1);
			НоваяЗапись.СуммаУпр    = НоваяЗапись.СуммаУпр*?(НоваяЗапись.СуммаУпр>0,-1,1);
			
			НоваяЗапись.Заказано       = НоваяЗапись.Заказано*?(НоваяЗапись.Заказано>0,-1,1);
			НоваяЗапись.СуммаЗаказаУпр = НоваяЗапись.СуммаЗаказаУпр*?(НоваяЗапись.СуммаЗаказаУпр>0,-1,1);
			НоваяЗапись.Недопоставлено = НоваяЗапись.Недопоставлено*?(НоваяЗапись.Недопоставлено>0,-1,1);
			НоваяЗапись.НедопоставленоСуммаУпр = НоваяЗапись.НедопоставленоСуммаУпр*?(НоваяЗапись.НедопоставленоСуммаУпр>0,-1,1);
			НоваяЗапись.Перепоставлено = НоваяЗапись.Перепоставлено*?(НоваяЗапись.Перепоставлено>0,-1,1);
			НоваяЗапись.ПерепоставленоСуммаУпр = НоваяЗапись.ПерепоставленоСуммаУпр*?(НоваяЗапись.ПерепоставленоСуммаУпр>0,-1,1);
			НоваяЗапись.ПовышениеСтоимостиУпр = НоваяЗапись.ПовышениеСтоимостиУпр*?(НоваяЗапись.ПовышениеСтоимостиУпр>0,-1,1);
			НоваяЗапись.ПонижениеСтоимостиУпр = НоваяЗапись.ПонижениеСтоимостиУпр*?(НоваяЗапись.ПонижениеСтоимостиУпр>0,-1,1);
		КонецЕсли;
		
		Счетчик = Счетчик+1;
		
		// Найдем коэффициент пересчета из управленческой валюты в валюту регл.учета		
		НоваяЗапись.СуммаРег =  НоваяЗапись.СуммаУпр * Коэффициент;
		НоваяЗапись.СуммаЗаказаРег =  НоваяЗапись.СуммаЗаказаУпр * Коэффициент;
		НоваяЗапись.НедопоставленоСуммаРег =  НоваяЗапись.НедопоставленоСуммаУпр * Коэффициент;
		НоваяЗапись.ПерепоставленоСуммаРег =  НоваяЗапись.ПерепоставленоСуммаУпр * Коэффициент;
		НоваяЗапись.ПовышениеСтоимостиРег =  НоваяЗапись.ПовышениеСтоимостиУпр * Коэффициент;
		НоваяЗапись.ПонижениеСтоимостиРег =  НоваяЗапись.ПонижениеСтоимостиУпр * Коэффициент;
		
	КонецЦикла;
	
	Для Каждого СтрокаПартии Из ТаблицаПартий Цикл
		
		НоваяЗапись = Добавить();
		НоваяЗапись.Период          = ДокументОбъект.Дата;
		НоваяЗапись.Регистратор     = ДокументОбъект.Ссылка;
		НоваяЗапись.Контрагент      = Контрагент;
		НоваяЗапись.ЗаказПоставщику = ЗаказОснование;
		НоваяЗапись.Номенклатура    = СтрокаПартии.Номенклатура;
		НоваяЗапись.ХозОперация     = ДокументОбъект.ХозОперация;
		НоваяЗапись.Количество      = СтрокаПартии.Количество;
		НоваяЗапись.СуммаУпр        = СтрокаПартии.СуммаУпр;
		НоваяЗапись.Перепоставлено  = СтрокаПартии.Количество;
		НоваяЗапись.ПерепоставленоСуммаУпр = СтрокаПартии.СуммаУпр;
		
		// если возвраты, то сделаем все отрицательным
		Если Сторно Тогда
			НоваяЗапись.Количество  = НоваяЗапись.Количество*?(НоваяЗапись.Количество>0,-1,1);
			НоваяЗапись.СуммаУпр    = НоваяЗапись.СуммаУпр*?(НоваяЗапись.СуммаУпр>0,-1,1);
			НоваяЗапись.Перепоставлено = НоваяЗапись.Перепоставлено*?(НоваяЗапись.Перепоставлено>0,-1,1);
			НоваяЗапись.ПерепоставленоСуммаУпр = НоваяЗапись.ПерепоставленоСуммаУпр*?(НоваяЗапись.ПерепоставленоСуммаУпр>0,-1,1);
		КонецЕсли;
		
		// Найдем коэффициент пересчета из управленческой валюты в валюту регл.учета		
		НоваяЗапись.СуммаРег =  НоваяЗапись.СуммаУпр * Коэффициент;
		НоваяЗапись.ПерепоставленоСуммаРег =  НоваяЗапись.ПерепоставленоСуммаУпр * Коэффициент;
		
	КонецЦикла;
	
	// убиваем циклическую ссылку
	ДокументОбъект             = Неопределено;
	ШапкаДокумента             =  Неопределено;
	ЗаказОснование             = Неопределено;
	РезультатЗапросаПоПартиям  = Неопределено;
	ТаблицаПартий              = Неопределено;
	ЗакрытиеЗаказовПоставщикам = 0;
	
	Возврат Результат;
КонецФункции

#Область Инициализация

Сторно = Ложь;

#КонецОбласти

#КонецЕсли
